ci/mutants/M1-apply-seccomp-empty.patch
--- a/crates/git-vista-server/src/bin/gv-sandbox/imp/mod.rs
+++ b/crates/git-vista-server/src/bin/gv-sandbox/imp/mod.rs
@@ -1036,10 +1036,4 @@
-// Mutation-matrix anchor M1: the filter is applied at this single boundary.
-fn apply_seccomp(net: seccomp_filter::NetScope) {
-    let program = match seccomp_filter::build(net) {
-        Ok(p) => p,
-        Err(e) => die(EXIT_SECCOMP, &format!("seccomp filter build failed: {e}")),
-    };
-    if let Err(e) = seccompiler::apply_filter(&program) {
-        die(EXIT_SECCOMP, &format!("seccomp apply failed: {e}"));
-    }
+// Mutation-matrix anchor M1: the filter is applied at this single boundary.
+fn apply_seccomp(net: seccomp_filter::NetScope) {
+    let _ = net;
 }
