ci/mutants/M2-skip-landlock-restrict-self.patch
--- a/crates/git-vista-server/src/bin/gv-sandbox/imp/mod.rs
+++ b/crates/git-vista-server/src/bin/gv-sandbox/imp/mod.rs
@@ -982,16 +982,7 @@
     if unsafe { libc::prctl(libc::PR_SET_NO_NEW_PRIVS, 1, 0, 0, 0) } != 0 {
         die(EXIT_LANDLOCK, "prctl(PR_SET_NO_NEW_PRIVS) failed");
     }
-    if unsafe { libc::syscall(SYS_LANDLOCK_RESTRICT_SELF, ruleset, 0usize) } != 0 {
-        die(
-            EXIT_LANDLOCK,
-            &format!(
-                "landlock_restrict_self failed: {}",
-                std::io::Error::last_os_error()
-            ),
-        );
-    }
-    unsafe { libc::close(ruleset) };
+    return;
 }

 // A plain sibling of this file: `src/bin/gv-sandbox/imp/seccomp_filter.rs`,
