ci/mutants/M3-empty-secret-excludes.patch
--- a/crates/git-vista-server/src/sandbox/mod.rs
+++ b/crates/git-vista-server/src/sandbox/mod.rs
@@ -193,10 +193,7 @@
 /// secret set is silently empty — `~/.ssh` re-exposed with nothing to signal it.
 /// Every policy builder must go through here rather than joining by hand.
-pub(crate) fn secret_excludes_for_home(home: &std::path::Path) -> Vec<PathBuf> {
-    DEFAULT_SECRET_EXCLUDES
-        .iter()
-        .map(|s| home.join(s))
-        .collect()
+pub(crate) fn secret_excludes_for_home(_home: &std::path::Path) -> Vec<PathBuf> {
+    Vec::new()
 }
 
 /// System trees granted read+execute in every tier.
