ci/mutants/M4-remove-strict-unshare-net.patch
--- a/crates/git-vista-server/src/sandbox/mod.rs
+++ b/crates/git-vista-server/src/sandbox/mod.rs
@@ -250,7 +250,6 @@
     "/dev/shm",
     "--unshare-pid",
-    "--unshare-net",
     "--unshare-ipc",
     "--unshare-uts",
     "--unshare-cgroup",
