ci/mutants/M7-widen-prctl-comparison.patch
--- a/crates/git-vista-server/src/bin/gv-sandbox/seccomp_filter.rs
+++ b/crates/git-vista-server/src/bin/gv-sandbox/seccomp_filter.rs
@@ -127,7 +127,7 @@
 fn prctl_rule() -> Result<SeccompRule, seccompiler::BackendError> {
     SeccompRule::new(vec![SeccompCondition::new(
         0, // prctl's first argument, the option
-        SeccompCmpArgLen::Dword,
+        SeccompCmpArgLen::Qword,
         SeccompCmpOp::Eq,
         libc::PR_SET_SECCOMP as u64,
     )?])
